
Процедура ОбработкаПроведения(Отказ, Режим)
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!

	// регистр ОборотТовара 
	Движения.ОборотТовара.Записывать = Истина;
	Для Каждого ТекСтрокаТовар Из Товар Цикл
		Движение = Движения.ОборотТовара.Добавить();
		Движение.Период = Дата;
		Движение.Товар = ТекСтрокаТовар.Товар;
		Движение.Поставщик = Поставщики;
		Движение.Склад = Склад;
		Движение.Цена = ТекСтрокаТовар.Цена;
		Движение.Сумма = ТекСтрокаТовар.Сумма;
		Движение.Количество = ТекСтрокаТовар.Количество;
	КонецЦикла;

	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры
