
&НаСервере
Процедура СправкаНаСервере()
	Водитель = Справочники.Сотрудники.Выбрать();	
	
	Пока Водитель.Следующий() Цикл   
		
		Спр1 = Справочники.ТранспортныеСредства.Выбрать();		
		счет = 0;
		Пока Спр1.Следующий() Цикл	
			Если Спр1.ЭтоГруппа Тогда
				Продолжить; 
			КонецЕсли;		
			Если Водитель.Код = Спр1.Водитель.Код Тогда
				счет = счет + 1;
				Если счет = 2 Тогда
					Сообщить(Спр1.Водитель.Наименование);
					Прервать; 
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;  
КонецПроцедуры

&НаКлиенте
Процедура Справка(Команда)
	СправкаНаСервере();
КонецПроцедуры
