Функция ПолучитьЗначениеПериодическогоРеквизита(ТранспортныеСредства)
	Возврат РегистрыСведений.ИсторияТС.ПолучитьПоследнее(ТекущаяДата(), Новый Структура("ТранспортныеСредства", ТранспортныеСредства)).Значение;
КонецФункции

&НаКлиенте
Процедура Справка(Команда)
	СправкаНаСервере();
КонецПроцедуры

&НаСервере
Процедура СправкаНаСервере()
	// Вставить содержимое обработчика. 
	Спр = Справочники.ТранспортныеСредства.Выбрать();
	Пока Спр.Следующий() Цикл
		// Группы справочника пропускаются
		Если Спр.ЭтоГруппа или Спр.Объем_двигателя >= 40 Тогда
			Продолжить;
		КонецЕсли;
		Сообщить(Спр.Наименование);
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура Печать(Команда)
	ПечатьНаСервере().Показать("Список автомобилей");
КонецПроцедуры

&НаСервере
Функция ПечатьНаСервере()
	ТабДок = Новый ТабличныйДокумент(); 
	Макет = Справочники.ТранспортныеСредства.ПолучитьМакет("Макет");
	ОбластьШапка = Макет.ПолучитьОбласть("Шапка");
	ОбластьШапка.Параметры.Дата =
	// Форматирование даты
	Формат(ТекущаяДата(), "ДФ=dd.MM.yyyy");
	ТабДок.Вывести(ОбластьШапка);
	ТабДок.НачатьАвтогруппировкуСтрок();
	Спр = Справочники.ТранспортныеСредства.ВыбратьИерархически();
	Пока Спр.Следующий() Цикл
		Если Спр.ЭтоГруппа Тогда
			ОбластьГруппа = Макет
			.ПолучитьОбласть("Группа");
			ОбластьГруппа.Параметры.Заполнить(Спр);
			// Заполнение параметра расшифровки
			ОбластьГруппа.Параметры.СсылкаГруппа =
			Спр.Ссылка;
			ТабДок.Вывести(ОбластьГруппа,
			Спр.УровеньВВыборке());
		Иначе
			ОбластьЭлемент = Макет
			.ПолучитьОбласть("Элемент");
			ДатаВыпуска = Спр.Дата_выпуска;
			СколькоЛет = Год(ТекущаяДата()) - Год(ДатаВыпуска);
			ОбластьЭлемент.Область("R1C3").Примечание.Текст = Спр.Наименование + " уже " + СколькоЛет + " лет";
			ОбластьЭлемент.Параметры.Заполнить(Спр);
			ОбластьЭлемент.Параметры.Водитель = ПолучитьЗначениеПериодическогоРеквизита(Спр.Ссылка);
			ТабДок.Вывести(ОбластьЭлемент, 
			Спр.УровеньВВыборке(), 
			Спр.Владелец, Ложь);
		КонецЕсли;
	КонецЦикла;
	ТабДок.ЗакончитьАвтогруппировкуСтрок(); 
	
	ТабДок.ТолькоПросмотр = Истина;
	ТабДок.ОтображатьЗаголовки = Ложь;
	ТабДок.ОтображатьСетку = Ложь; 
	Возврат ТабДок;
КонецФункции
