Перем МодификацияРеквизита;

&НаСервере
Процедура ПриОткрытииНаСервере()
	МодификацияРеквизита = Ложь;
	// Не использовать для новых объектов
	Если НЕ ЗначениеЗаполнено(Объект.Ссылка) Тогда
		Возврат;
	КонецЕсли;
	// Запрос к виртуальной таблице СрезПоследних
	// регистра сведений ИсторияЗначений
	Запрос = Новый Запрос();
	Запрос.Текст =
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	ИсторияЗначенийСрезПоследних.Значение КАК Водитель
		|ИЗ
		|	РегистрСведений.ИсторияТС.СрезПоследних(&Дата, ТранспортныеСредства = &ТранспортныеСредства) КАК ИсторияЗначенийСрезПоследних";
	Запрос.УстановитьПараметр("Дата", ТекущаяДата());
	Запрос.УстановитьПараметр("ТранспортныеСредства", Объект.Ссылка);
	Результат = Запрос.Выполнить().Выбрать();
	// Получение последнего значения
	Если Результат.Следующий() Тогда
		Водитель = Результат.Водитель;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ПриОткрытииНаСервере();
КонецПроцедуры

&НаСервере
Процедура ПриЗаписиНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	Если МодификацияРеквизита = Ложь Тогда
		Возврат;  
	КонецЕсли;
		Рег = РегистрыСведений.ИсторияТС.СоздатьМенеджерЗаписи();
		Рег.Период = ТекущаяДата();
		Рег.ТранспортныеСредства = Объект.Ссылка;
		Рег.Значение = Водитель;
		Рег.Записать();
КонецПроцедуры

&НаСервере
Процедура ВодительПриИзмененииНаСервере()
	МодификацияРеквизита = Истина;
	ЭтаФорма.Модифицированность = Истина;
КонецПроцедуры


&НаКлиенте
Процедура ВодительПриИзменении(Элемент)
	ВодительПриИзмененииНаСервере();
КонецПроцедуры

